import * as React from 'react';

type Props = {
  className?: string;
};

const FacebookIcon = ({ className }: Props): JSX.Element => (
  <svg
    className={className}
    xmlns="http://www.w3.org/2000/svg"
    width="75.262"
    height="71.508"
    viewBox="0 0 75.262 71.508"
  >
    <g
      id="Сгруппировать_375"
      data-name="Сгруппировать 375"
      transform="translate(0 0)"
    >
      <path
        id="Контур_3"
        data-name="Контур 3"
        d="M308.345,508.668q-8.713,1.559-17.488,2.871Q299.63,510.227,308.345,508.668Zm0,0"
        transform="translate(-233.084 -447.127)"
        fill="#414040"
      />
      <path
        id="Контур_4"
        data-name="Контур 4"
        d="M307.67,507.793c-2.776.561-5.554,1.073-8.329,1.6C302.114,508.867,304.892,508.354,307.67,507.793Zm0,0"
        transform="translate(-235.452 -448.866)"
        fill="#414040"
      />
      <path
        id="Контур_5"
        data-name="Контур 5"
        d="M298.109,510.34q-10.2,1.261-20.5,2.218Q287.9,511.613,298.109,510.34Zm0,0"
        transform="translate(-222.911 -443.803)"
        fill="#414040"
      />
      <path
        id="Контур_6"
        data-name="Контур 6"
        d="M296.275,509.738c-3.266.479-6.553.922-9.829,1.344C289.719,510.66,293.009,510.217,296.275,509.738Zm0,0"
        transform="translate(-225.031 -444.999)"
        fill="#414040"
      />
      <path
        id="Контур_7"
        data-name="Контур 7"
        d="M314.027,506.41c-2.446.561-4.9,1.144-7.363,1.683C309.123,507.554,311.578,506.982,314.027,506.41Zm0,0"
        transform="translate(-241.277 -449.765)"
        fill="#414040"
      />
      <path
        id="Контур_8"
        data-name="Контур 8"
        d="M330.421,502.113c-1.978.62-3.957,1.2-5.937,1.808C326.464,503.316,328.443,502.733,330.421,502.113Zm0,0"
        transform="translate(-255.9 -456.737)"
        fill="#414040"
      />
      <path
        id="Контур_9"
        data-name="Контур 9"
        d="M325.526,503.543c-2.149.62-4.309,1.248-6.468,1.845Q322.3,504.493,325.526,503.543Zm0,0"
        transform="translate(-251.516 -454.424)"
        fill="#414040"
      />
      <path
        id="Контур_10"
        data-name="Контур 10"
        d="M318.938,505.254c-2.277.583-4.575,1.121-6.872,1.682C314.366,506.386,316.664,505.838,318.938,505.254Zm0,0"
        transform="translate(-245.688 -451.638)"
        fill="#414040"
      />
      <path
        id="Контур_11"
        data-name="Контур 11"
        d="M284.5,511.09q-5.5.507-11.022.911Q279,511.6,284.5,511.09Zm0,0"
        transform="translate(-214.319 -442.313)"
        fill="#414040"
      />
      <path
        id="Контур_12"
        data-name="Контур 12"
        d="M74.114,35.754C74.114,16.008,57.523,0,37.057,0S0,16.008,0,35.754,16.591,71.508,37.057,71.508h.652V43.662H29.743V34.711H37.7v-6.6c0-7.644,4.833-11.8,11.9-11.8a67.9,67.9,0,0,1,7.138.353v7.992H51.88c-3.834,0-4.6,1.763-4.6,4.347v5.7h9.188l-1.2,8.951H47.28v26.46C63.163,65.714,74.108,51.7,74.114,35.754Zm0,0"
        transform="translate(0 0)"
        fill="#414040"
      />
      <path
        id="Контур_13"
        data-name="Контур 13"
        d="M286.742,511.43q-10.882.771-21.851,1.191Q275.852,512.217,286.742,511.43Zm0,0"
        transform="translate(-212.227 -441.636)"
        fill="#414040"
      />
      <path
        id="Контур_14"
        data-name="Контур 14"
        d="M272.078,511.836q-5.776.211-11.574.315Q266.3,512.047,272.078,511.836Zm0,0"
        transform="translate(-203.224 -440.83)"
        fill="#414040"
      />
    </g>
  </svg>
);

FacebookIcon.defaultProps = {
  className: '',
};

export default FacebookIcon;
